Documents/ПродажаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>ПродажаТоваров</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПродажаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РасчетСуммы(Элемент)
	    ТД=Элементы.Товары.ТекущиеДанные;
	    ТД.Сумма=ТД.Цена*ТД.Количество;
		если Объект.Товары.Итог("Сумма")>10000 тогда
			сообщение=новый СообщениеПользователю;
			сообщение.Текст="Вам предоставляется бесплатная доставка!!!";
			сообщение.Сообщить();

		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость=истина;
		иначе
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость=ложь;
		КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчетСуммы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчетСуммы(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	тест=Элементы.Товары;
	если Объект.Товары.Итог("Сумма")>10000 тогда
		сообщение=новый СообщениеПользователю;
		сообщение.Текст="Вам предоставляется бесплатная доставка!!!";
		сообщение.Сообщить();

	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость=истина;
	иначе
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость=ложь;
	КонецЕсли;
КонецПроцедуры
